def solution():
    """Как известно, нет самолетов-мужчин и самолетов-женщин. Однако, каждому самолету на Земле нравится какой-то один
    другой самолет. Всего на Земле n самолетов, пронумерованных от 1 до n, при этом самолету номер i нравится самолет
    fi, где 1≤fi≤n, а также fi≠i.

    Назовем любовным треугольником ситуацию, когда самолету A нравится самолет B, самолету B нравится самолет C, а
    самолету C нравится самолет A. Проверьте, есть ли на Земле хотя бы один любовный треугольник.

    Входные данные
    Первая строка содержит одно целое число n (2≤n≤5000) — число самолетов.

    Вторая строка содержит n целых чисел f1,f2,...,fn (1≤fi≤n, fi≠i), что означает, что i-му самолету нравится fi-й.

    Выходные данные
    Выведите «YES», если на Земле есть любовный треугольник из самолетов. Иначе выведите «NO»."""
    n = int(input())
    f = [int(_) for _ in input().split()]
    for i in range(n):
        if f[f[f[i] - 1] - 1] == i + 1:
            return 'YES'
    return 'NO'
    pass


print(solution())
